## aggregation

### Example 1

In [1]:
import pandas as pd
import numpy as np

In [2]:
import pandas as pd
import numpy as np

# Create a random number generator
rng = np.random.default_rng()

# Create a DataFrame
df = pd.DataFrame({
    'key' : ['A', 'B', 'C', 'A', 'B', 'C'],  # 'key' column with categorical values
    'data1' : range(6),  # 'data1' column with integers from 0 to 5
    'data2' : rng.integers(0, 10, size=6)  # 'data2' column with 6 random integers between 0 and 9
})
df

  key  data1  data2
0   A      0      4
1   B      1      2
2   C      2      8
3   A      3      9
4   B      4      6
5   C      5      4

In [3]:
grouped = df.groupby('key')
grouped

In [4]:
for x,y in grouped:
    print(x)
    print(y)
    print()

A
  key  data1  data2
0   A      0      4
3   A      3      9

B
  key  data1  data2
1   B      1      2
4   B      4      6

C
  key  data1  data2
2   C      2      8
5   C      5      4

In [5]:
grouped.get_group('A')

  key  data1  data2
0   A      0      4
3   A      3      9

In [6]:
grouped.get_group('B')

  key  data1  data2
1   B      1      2
4   B      4      6

In [7]:
grouped.get_group('C')

  key  data1  data2
2   C      2      8
5   C      5      4

In [8]:
df.groupby('key')['data1'].min()

key
A    0
B    1
C    2
Name: data1, dtype: int64

In [9]:
df.groupby('key')['data1'].max()

key
A    3
B    4
C    5
Name: data1, dtype: int64

In [10]:
df.groupby('key')['data1'].mean()

key
A    1.5
B    2.5
C    3.5
Name: data1, dtype: float64

In [11]:
df.groupby('key').aggregate(['min', 'max', 'mean'])

    data1          data2
      min max mean   min max mean
key
A       0   3  1.5     4   9  6.5
B       1   4  2.5     2   6  4.0
C       2   5  3.5     4   8  6.0

### Example 2

In [13]:
import pandas as pd
import os
print(os.getcwd())

/Users/mohammadasim/Desktop/Python/14. Pandas/5. Data-Grouping and Aggregation

In [14]:
df = pd.read_csv("/Users/mohammadasim/Desktop/Python/14. Pandas/5. Data-Grouping and Aggregation/Flavors.csv")

In [15]:
df

,Flavor,Base Flavor,Liked,Flavor Rating,Texture Rating,Total Rating
0,Mint Chocolate Chip,Vanilla,Yes,10.0,8.0,18.0
1,Chocolate,Chocolate,Yes,8.8,7.6,16.6
2,Vanilla,Vanilla,No,4.7,5.0,9.7
3,Cookie Dough,Vanilla,Yes,6.9,6.5,13.4
4,Rocky Road,Chocolate,Yes,8.2,7.0,15.2
5,Pistachio,Vanilla,No,2.3,3.4,5.7
6,Cake Batter,Vanilla,Yes,6.5,6.0,12.5
7,Neapolitan,Vanilla,No,3.8,5.0,8.8
8,Chocolte Fudge Brownie,Chocolate,Yes,8.2,7.1,15.3

In [16]:
grouped = df.groupby('Base Flavor')

In [17]:
grouped.get_group('Chocolate')

,Flavor,Base Flavor,Liked,Flavor Rating,Texture Rating,Total Rating
1,Chocolate,Chocolate,Yes,8.8,7.6,16.6
4,Rocky Road,Chocolate,Yes,8.2,7.0,15.2
8,Chocolte Fudge Brownie,Chocolate,Yes,8.2,7.1,15.3

In [18]:
grouped.get_group('Vanilla')

,Flavor,Base Flavor,Liked,Flavor Rating,Texture Rating,Total Rating
0,Mint Chocolate Chip,Vanilla,Yes,10.0,8.0,18.0
2,Vanilla,Vanilla,No,4.7,5.0,9.7
3,Cookie Dough,Vanilla,Yes,6.9,6.5,13.4
5,Pistachio,Vanilla,No,2.3,3.4,5.7
6,Cake Batter,Vanilla,Yes,6.5,6.0,12.5
7,Neapolitan,Vanilla,No,3.8,5.0,8.8

In [19]:
df.groupby('Base Flavor').max()

                 Flavor Liked  Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate    Rocky Road   Yes            8.8             7.6          16.6
Vanilla         Vanilla   Yes           10.0             8.0          18.0

In [20]:
df.groupby('Base Flavor').count()

             Flavor  Liked  Flavor Rating  Texture Rating  Total Rating
Base Flavor
Chocolate         3      3              3               3             3
Vanilla           6      6              6               6             6

In [21]:
df.groupby('Base Flavor').sum()

,Flavor,Liked,Flavor Rating,Texture Rating,Total Rating
Base Flavor,,,,,
Chocolate,ChocolateRocky RoadChocolte Fudge Brownie,YesYesYes,25.2,21.7,47.1
Vanilla,Mint Chocolate ChipVanillaCookie DoughPistachi...,YesNoYesNoYesNo,34.2,33.9,68.1

In [22]:
df.groupby('Base Flavor').agg({'Flavor Rating': ['mean', 'max', 'count','sum']})

            Flavor Rating
                     mean   max count   sum
Base Flavor
Chocolate             8.4   8.8     3  25.2
Vanilla               5.7  10.0     6  34.2

### Example 3

In [23]:
import pandas as pd
import os
print(os.getcwd())

/Users/mohammadasim/Desktop/Python/14. Pandas/5. Data-Grouping and Aggregation

In [24]:
import pandas as pd
df = pd.read_csv("/Users/mohammadasim/Desktop/Python/14. Pandas/5. Data-Grouping and Aggregation/orders.csv")

In [25]:
df

         order_id product_name         category       city  sales  profit
0  CA-2020-152156           p1        Furniture  Bangalore  10000     500
1  CA-2020-138688           p2        Furniture  Bangalore  20000     400
2  US-2019-108966           p3       Technology    Chennai  25000     200
3  CA-2021-114412           p4  Office Supplies    Chennai  30000     250
4  CA-2020-161389           p5       Technology  Bangalore  35000     800
5  US-2019-119883           p6  Office Supplies  Bangalore  40000     700

In [26]:
df['sales']

0    10000
1    20000
2    25000
3    30000
4    35000
5    40000
Name: sales, dtype: int64

In [27]:
df['sales'].max()

40000

In [28]:
grouped = df.groupby('category')

In [29]:

grouped.get_group('Office Supplies')

         order_id product_name         category       city  sales  profit
3  CA-2021-114412           p4  Office Supplies    Chennai  30000     250
5  US-2019-119883           p6  Office Supplies  Bangalore  40000     700

In [30]:
grouped.get_group('Furniture')

         order_id product_name   category       city  sales  profit
0  CA-2020-152156           p1  Furniture  Bangalore  10000     500
1  CA-2020-138688           p2  Furniture  Bangalore  20000     400

In [31]:
grouped.get_group('Technology')

         order_id product_name    category       city  sales  profit
2  US-2019-108966           p3  Technology    Chennai  25000     200
4  CA-2020-161389           p5  Technology  Bangalore  35000     800

In [32]:
df

         order_id product_name         category       city  sales  profit
0  CA-2020-152156           p1        Furniture  Bangalore  10000     500
1  CA-2020-138688           p2        Furniture  Bangalore  20000     400
2  US-2019-108966           p3       Technology    Chennai  25000     200
3  CA-2021-114412           p4  Office Supplies    Chennai  30000     250
4  CA-2020-161389           p5       Technology  Bangalore  35000     800
5  US-2019-119883           p6  Office Supplies  Bangalore  40000     700

In [33]:
df.groupby('category')['sales'].max()

category
Furniture          20000
Office Supplies    40000
Technology         35000
Name: sales, dtype: int64

In [34]:
df.groupby('category')['sales'].agg(['mean','min','max','count'])

                    mean    min    max  count
category
Furniture        15000.0  10000  20000      2
Office Supplies  35000.0  30000  40000      2
Technology       30000.0  25000  35000      2

#### groupby on multiple columns

In [35]:
df.groupby(['category','city'])['sales'].agg(['mean','min','max','count'])

                              mean    min    max  count
category        city
Furniture       Bangalore  15000.0  10000  20000      2
Office Supplies Bangalore  40000.0  40000  40000      1
                Chennai    30000.0  30000  30000      1
Technology      Bangalore  35000.0  35000  35000      1
                Chennai    25000.0  25000  25000      1

#### Applying aggregate function on multiple columns

In [36]:
df

         order_id product_name         category       city  sales  profit
0  CA-2020-152156           p1        Furniture  Bangalore  10000     500
1  CA-2020-138688           p2        Furniture  Bangalore  20000     400
2  US-2019-108966           p3       Technology    Chennai  25000     200
3  CA-2021-114412           p4  Office Supplies    Chennai  30000     250
4  CA-2020-161389           p5       Technology  Bangalore  35000     800
5  US-2019-119883           p6  Office Supplies  Bangalore  40000     700

In [37]:
df.groupby('category').agg({'sales':'min', 'profit':'max'})

                 sales  profit
category
Furniture        10000     500
Office Supplies  30000     700
Technology       25000     800